import { Fragment } from "react";
import { H3, H4, H6 } from "@component/Typography";
import { Card1 } from "@component/Card1";
import DashboardPageHeader from "@component/layout/DashboardPageHeader";
import TermsandConditionsLayout from "@component/layout/terms-and-conditions";
// ====================================================
// ====================================================

const Terms = () => {
  return (
    <Fragment>
      <DashboardPageHeader title="การยกเลิกการสั่งซื้อสินค้า" iconName="_close" />

<Card1>
       <H3>การยกเลิกการสั่งซื้อสินค้า</H3> 
         <ul>
            <li>บริษัทฯ ขอสงวนสิทธิ์ในการยกเลิกรายการสั่งซื้อสินค้าของลูกค้า หากตรวจสอบพบว่า ไม่ตรงตามเงื่อนไขฯ ในการสั่งซื้อหรือมีความผิดพลาดด้านราคาและข้อมูลผลิตภัณฑ์นั้น ๆ ทาง ihavecpu.com จะพยายามแสดงราคาและรายละเอียดของผลิตภัณฑ์ที่ปรากฏบนแพลตฟอร์มที่ถูกต้องและแม่นยำมากที่สุดเท่าที่จะทำได้ หาก ihavecpu.com พบข้อผิดพลาดเกี่ยวกับราคาผลิตภัณฑ์ซึ่งท่านได้สั่งซื้อเข้ามา ทาง ihavecpu.com จะแจ้งให้ท่านทราบโดยเร็ว</li>
            <li>ท่านต้องยอมรับและเห็นชอบว่าการเข้าใช้งานอาจมีความคลาดเคลื่อนของข้อมูลต่าง ๆ หากท่านไม่พึงพอใจหรือพบว่ารายละเอียดสินค้าไม่ได้ตรงกับสินค้าของจริง ท่านสามารถดำเนินการเพื่อรับบริการหลังการขาย เพื่อขอรับเงินคืนหรือขอเปลี่ยนสินค้าใหม่ที่สอดคล้องกับนโยบายการรับคืนผลิตภัณฑ์ของ ihavecpu.com ดูรายละเอียดนโยบายคืนสินค้า</li>
            <li>ในกรณีที่มีข้อผิดพลาดเกี่ยวกับข้อมูลหรือราคาของสินค้า ซึ่งอาจก่อให้เกิดปัญหาการขาดแคลนสินค้า หรือ ปัญหาอื่น ๆ ที่ทำให้ ihavecpu.com ไม่สามารถจัดส่งสินค้าได้ ท่านและ  ihavecpu.com มีสิทธิในการยกเลิกคำสั่งซื้อนั้นๆได้ หากคำสั่งซื้อของท่านถูกยกเลิก แต่ท่านได้ทำการชำระเงินเรียบร้อยแล้ว ทาง  ihavecpu.com จะดำเนินการคืนเงินให้ตามนโยบายคืนเงินของบริษัทฯ ดูรายละเอียดการคืนเงิน คลิก</li>
            <li> ihavecpu.com ขอสงวนสิทธิ์ในการยกเลิกคำสั่งซื้อได้ทันที หากตรวจสอบพบว่า เป็นการซื้อขายที่ไม่ถูกต้องตามเงื่อนไขตามที่บริษัทฯ กำหนด หรือ เป็นการเหมาซื้อขายในเชิงพาณิชย์</li>
            <li>หากท่านมีคำถามที่เกี่ยวข้องกับ ราคาของผลิตภัณฑ์ รายละเอียดของผลิตภัณฑ์ หรือ สีของผลิตภัณฑ์ กรุณาติดต่อทาง เแผนกบริการลูกค้า ไอ แฮฟ ซีพียู ที่เบอร์ 02-105-4757 หรือ info@ihavecpu.com ได้ในเวลาทำการ ตั้งแต่เวลา 10.00 น. -17.00 น. (เว้นวันเสาร์)</li>
         </ul>

         <H4>ลูกค้าจะยกเลิกการสั่งซื้อสินค้าได้อย่างไร?</H4>
         <ul>
            <li>ในกรณีที่ลูกค้ายังไม่มีการชำระค่าสินค้า หรือ มีการเลือกชำระค่าสินค้าแบบเก็บเงินปลายทาง ( COD ) ลูกค้าสามารถทำการโทรติดต่อเจ้าหน้าที่ แผนกบริการลูกค้าช้อปออนไลน์ ที่เบอร์ 02-105-4757 ก่อนเวลา 11.00 น. เพื่อแจ้งการยกเลิกการสั่งซื้อ รายการสินค้าดังกล่าวจะถูกยกเลิกโดยทันที หรือกด ยกเลิกคำสั่งซื้อ โดยไปที ประวัติการสั่งซื้อ และกดทำรายการยกเลิกสินค้า พร้อมแจ้งเหตุผลในการยกเลิกสินค้า </li>
            <li>ในกรณีที่ลูกค้ามีการชำระเงินเสร็จสิ้นแล้ว ทั้งแบบชำระผ่านบัตรเครดิต หรือชำระแบบเงินสดให้ลูกค้าทำการโทรศัพท์ติดต่อ เจ้าหน้าที่ แผนกบริการลูกค้าช้อปออนไลน์ ที่เบอร์ 02-105-4757 ก่อนเวลา 11.00 น. ได้ทุกวันในเวลาทำการ โดยเจ้าหน้าที่จะตรวจสอบสถานะการจัดส่งสินค้า หากสินค้ายังไม่มีการจัดส่ง จะทำการยกเลิกการจัดส่งสินค้าและทำการคืนเงินให้กับลูกค้า ตามประเภทและวิธีการชำระเงิน ภายใน 15 -30 วันทำการ</li>
            <li>ในกรณีที่ลูกค้าไม่ได้มีการโทรศัพท์แจ้งขอยกเลิกการสั่งซื้อ แต่ต้องการยกเลิกรายการสั่งซื้อเมื่อสินค้ามีการจัดส่งถึงลูกค้าจากเจ้าหน้าที่บริษัทฯขนส่ง ให้ลูกค้าแจ้ง เแผนกบริการลูกค้า ihavecpu.com ที่เบอร์ 02-105-4757 หรือ info@ihavecpu.com ได้ในเวลาทำการ ตั้งแต่เวลา 10.00 น. -17.00 น. (เว้นวันเสาร์)</li>
            <li>เพื่อแจ้งปฏิเสธการรับสินค้า ทางบริษัทฯ จะดำเนินการคืนเงินค่าสินค้าให้กับลูกค้าตามรายการสินค้า และตามรูปแบบการชำระเงิน จะมีระยะเวลาการคืน 15-30 วันทำการ โดยขอสงวนสิทธิ์การพิจารณายกเลิกการรับสินค้าตามความเหมาะสม และจากการพิจารณาของเจ้าหน้าที่แผนกบริการลูกค้า ดูรายละเอียดนโยบายคืนสินค้า คลิก</li>
         </ul>

         <H4>ลูกค้ายกเลิกการสั่งซื้อ แล้วจะได้รับเงินคืนเมื่อไหร่</H4>
         <ul>
            <li>ทางเราพร้อมดำเนินการคืนเงินให้กับลูกค้า โดยการคืนเงินจะขึ้นอยู่กับรูปแบบ การชำระเงินของลูกค้าที่ได้มีการทำรายการสั่งซื้อสินค้าเข้ามา โดยลูกค้าสามารถดูรายละเอียด ระยะเวลาวัน และรูปแบบการได้รับ เงินคืนได้จาก การคืนเงิน</li>
            <li>หากมีการยกเลิกการสั่งซื้อสินค้าแล้วจะได้รับเงินคืนทั้งหมดที่จ่ายไว้หรือไม่</li>
            <li>เราพร้อมคืนเงินลูกค้าตามมูลค่าเงินที่ลูกค้าที่ได้ทำการชำระเงินไว้ โดยหากรายการซื้อสินค้าของลูกค้าที่มีค่าขนส่งรวมไว้อยู่ ทางเรา จะดำเนินการคืนเงินค่าขนส่ง รวมกับค่าสินค้ากลับให้กับลูกค้า ตามรูปแบบการชำระเงินของลูกค้า ภายในระยะเวลาที่กำหนดไว้ 15–30 วัน โดยเจ้าหน้าที่จะติดต่อแจ้งสถานะการดำเนินการ ทาง อีเมล</li>
         </ul>

         <H4>ช้อปแล้วรับสินค้าที่ร้าน สาขา ไอ แฮฟ ซีพียู</H4>
         <p>ลูกค้าสามารถช้อปสินค้าบนเว็บไซต์และเลือกไปรับสินค้าที่ร้านสาขาของบริษัท ไอ แฮฟ ซีพียู จำกัด สาขาใกล้บ้านคุณ</p>
         <p>***หมายเหตุ : หากเลือกรับสินค้าที่ร้านสาขา จะไม่สามารถใช้บริการจ่ายเงินปลายทางที่ร้านสาขาได้</p>
     

         <H4>ระยะเวลาการจัดส่งสินค้า ไปที่จุดรับสินค้า ร้านสาขา ไอ แฮฟ ซีพียู จำกัด</H4>
         <p>กรุงเทพฯ และปริมณฑล : ระยะเวลา 1 – 3 วันทำการ นับตั้งแต่วันที่ลูกค้าทำรายการสั่งซื้อสินค้าสำเร็จ</p>
         <p>***ต่างจังหวัด : ระยะเวลา 2 – 4 วันทำการ นับตั้งแต่วันที่ลูกค้าทำรายการสั่งซื้อสินค้าสำเร็จ</p>

         <H4>หลักฐานที่ใช้ในการเข้ารับสินค้าที่ร้านสาขา</H4>
         <H6>กรณีผู้สั่งซื้อเข้ารับสินค้าด้วยตนเอง</H6>
         <ul>
            <li>แสดงบัตรประชาชนตัวจริงกับเจ้าหน้าที่ร้านสาขา</li>
            <li>เอกสารยืนยันคำสั่งซื้อสินค้า ( Order Confirmation ) ที่ได้รับผ่านทาง Email Address โดยลูกค้าสามารถแสดงข้อมูลหลักฐาน ผ่านอุปกรณ์ โทรศัพท์มือถือ หรือ แท็บเล็ต เพื่อแสดงต่อเจ้าหน้าที่ร้านสาขา</li>
         </ul>
         <p></p>
         <H6>กรณีให้ผู้อื่น รับสินค้าแทน</H6>
         <ul>
            <li>บัตรประชาชนตัวจริงของผู้รับ</li>
            <li>สำเนาบัตรประชาชนของผู้สั่งซื้อ พร้อมเซ็นมอบอำนาจ รับรองเอกสารถูกต้อง</li>
            <li>เอกสารยืนยันคำสั่งซื้อสินค้า ( Order Confirmation ) ที่ได้รับผ่านทาง Email Address โดยลูกค้าสามารถแสดงข้อมูลหลักฐาน ผ่านอุปกรณ์ โทรศัพท์มือถือ หรือ แท็บเล็ต เพื่อแสดงต่อเจ้าหน้าที่ได้</li>
         </ul>
      </Card1>
    </Fragment>
  );
};

Terms.layout = TermsandConditionsLayout;

export default Terms;
