import { Fragment } from "react";
import { H3, H4 } from "@component/Typography";
import { Card1 } from "@component/Card1";
import DashboardPageHeader from "@component/layout/DashboardPageHeader";
import TermsandConditionsLayout from "@component/layout/terms-and-conditions";

// ====================================================
// ====================================================

const Privacy = () => {
  return (
    <Fragment>
      <DashboardPageHeader title="นโยบายความเป็นส่วนตัว" iconName="shield" />

<Card1>
       <H3>นโยบายความเป็นส่วนตัว</H3> 
       <p>บริษัท ไอ แฮฟ ซีพียู จำกัด (“บริษัท”) เจ้าของ เว็บไซต์ www.ihavecpu.com ให้ความสำคัญต่อการคุ้มครองข้อมูลส่วนตัวของท่านมากที่สุด บริษัทจะเก็บรวบรวม บันทึก เผยแพร่และใช้งานเฉพาะข้อมูลที่ท่านให้กับทางบริษัทด้วยความสมัครใจเท่านั้น หากท่านไม่ยอมรับหรือไม่เห็นด้วยกับข้อตกลงและเงื่อนไขตามนโยบายความเป็นส่วนตัวนี้ ท่านจะไม่สามารถเข้าใช้งานระบบหรือแพลตฟอร์มของทางบริษัทได้</p>

      <p>บริษัทจะเก็บรวบรวมเฉพาะข้อมูลที่จำเป็นสำหรับบริษัทเพื่อที่จะให้บริการต่อท่าน บริษัทอาจขอเก็บข้อมูลของท่านเพิ่มเติมเพื่อวัตถุประสงค์ อาทิเช่น การพัฒนาการให้บริการของบริษัท หรือ การวิเคราะห์พฤติกรรมผู้บริโภค  โดยบริษัทจะเก็บเฉพาะข้อมูลที่เกี่ยวข้องกับข้อตกลงที่บริษัททำกับท่านเท่านั้น และจะเก็บข้อมูลของท่านตามระยะเวลาที่กฎหมายกำหนด หรือตราบเท่าที่ข้อมูลยังมีความเกี่ยวข้องกับวัตถุประสงค์ของการเก็บข้อมูลนั้นๆ</p>

      <p>ท่านสามารถเยี่ยมชมและเปิดดูแพลตฟอร์มของบริษัทได้โดยไม่ต้องให้ข้อมูลส่วนตัวกับบริษัท ระหว่างที่ท่านเข้าเยี่ยมชมหรือเปิดดู ข้อมูลของท่านจะไม่ถูกเปิดเผยต่อบริษัทและจะไม่ทราบถึงตัวตนของท่านยกเว้นท่านจะลงทะเบียนและสมัครเป็นสมาชิกบนแพลตฟอร์มของบริษัท และเข้าสู่ระบบผ่านบัญชีของท่านเท่านั้น</p>

      <H4>การเก็บรวบรวมข้อมูลส่วนบุคคล</H4>
         <p>ข้อมูลส่วนบุคคลที่บริษัทได้ทำการเก็บรวบรวมจากท่านได้แก่</p>
         <ul>
          <li><b>ข้อมูลที่ใช้ในการระบุตัวตน</b> ชื่อ-นามสกุล หมายเลขประจำตัวผู้เสียภาษี ชื่อบัญชีของท่านในสื่อสังคมออนไลน์ (Platform Specific ID)</li>
          <li><b>ข้อมูลติดต่อ</b> หมายเลขโทรศัพท์ อีเมล ที่อยู่ติดต่อ (บ้านเลขที่ จังหวัด อำเภอ/เขต ตำบล/แขวง รหัสไปรษณีย์)</li>
          <li><b>ข้อมูลที่ใช้ในการระบุตัวตนทางอิเล็กทรอนิกส์</b> หมายเลขไอพีของคอมพิวเตอร์หรืออุปกรณ์ของท่าน (IP Address) คุกกี้ (Cookie) หรือเทคโนโลยีที่ใช้ในการติดตามอื่น ๆ ที่มีลักษณะคล้ายคลึงกัน (Tracking Technologies)</li>
          <li><b>ข้อมูลพฤติกรรมการใช้งาน</b> ได้แก่ ข้อมูลการใช้งานและการท่องเว็บไซต์ เนื้อหาบนเว็บไซต์ที่ท่านเยี่ยมชม วันและเวลาที่ท่านได้เข้าใช้งานหรือสิ้นสุดการใช้งานเว็บไซต์ ข้อมูลเกี่ยวกับการค้นหาของท่านบนเว็บไซต์ ประเภทเบราว์เซอร์ที่ท่านใช้งาน ภาษาที่ท่านใช้งานบนเบราว์เซอร์ ระบบปฏิบัติการ ที่อยู่ของเว็บไซต์อื่นซึ่งเชื่อมโยงท่านเข้าสู่เว็บไซต์บริษัท ผ่านเครื่องมือดังต่อไปนี้ Google Analytics Google AdWords Hotjar LINE Optimise Optimonk และ Facebook Pixel</li>
         </ul>
         <p>ในกรณีที่ท่านได้ให้ข้อมูลของบุคคลภายนอกแก่บริษัท ท่านรับรองว่าได้แจ้งให้บุคคลภายนอกทราบถึงนโยบายฯ ฉบับนี้แล้ว และได้รับความยินยอมจากบุคคลภายนอกดังกล่าวแล้ว หรือมีฐานโดยชอบด้วยกฎหมายอื่นใดในการเปิดเผยข้อมูลส่วนบุคคลของบุคคลภายนอกแก่บริษัทเพื่อใช้ในการประมวลผลตามวัตถุประสงค์ที่ได้ระบุไว้ในนโยบายฯ ฉบับนี้ อย่างไรก็ตามในกรณีที่กฎหมายกำหนดให้บริษัท จะต้องได้รับความยินยอมจากบุคคลภายนอก ท่านรับรองว่าจะให้ความช่วยเหลือบริษัทฯ ในการขอความยินยอมจากบุคคลภายนอกด้วย</p>

         <H4>การใช้และการเปิดเผยข้อมูลส่วนบุคคล</H4>
         <p>ข้อมูลส่วนบุคคลของท่านที่บริษัทจัดเก็บจะถูกนำไปใช้ หรือแบ่งปันกับบุคคลภายนอก (ซึ่งรวมถึงบริษัทในเครือ นิติบุคคลอื่นที่เกี่ยวข้อง ผู้ให้บริการภายนอก และผู้ขายที่เป็นบุคคลภายนอก) เพื่อวัตถุประสงค์ดังต่อไปนี้ แต่ไม่เป็นการจำกัดเฉพาะ</p>
         <ul>
          <li>เพื่ออำนวยความสะดวกให้กับท่านในการใช้บริการ</li>
          <li>เพื่อดำเนินการเกี่ยวกับคำสั่งซื้อที่ท่านได้ส่งเข้ามาผ่านทางเว็บไซต์ www.ihavecpu.com</li>
          <li>เพื่อดำเนินการชำระเงินสำหรับคำสั่งซื้อของท่านที่ได้สั่งเข้ามาผ่านทางเว็บไซต์ www.ihavecpu.com เพื่อจัดส่งสินค้าที่ท่านได้สั่งซื้อผ่านเว็บไซต์ www.ihavecpu.com</li>
          </ul>
          <p>*เราอาจส่งข้อมูลส่วนบุคคลของท่านให้กับบุคคลภายนอกเพื่อทำการจัดส่งสินค้าให้ท่าน</p>
          <ul>
          <li>เพื่อแจ้งสถานะการจัดส่งสินค้าของคำสั่งซื้อของท่าน</li>
          <li>เพื่อใช้สำหรับการให้บริการที่เกี่ยวกับศูนย์บริการลูกค้า</li>
          <li>เพื่อยืนยันข้อมูลของท่านกับผู้ให้บริการขนส่งสินค้าสำหรับคำสั่งซื้อของท่าน</li>
          <li>เพื่อส่งข้อมูลเกี่ยวกับกิจกรรมทางการตลาด และโปรโมชั่นต่างๆ</li>
          <li>เพื่อจัดการเกี่ยวกับธุรกรรมทางการเงินที่เกี่ยวข้องกับการชำระเงินของท่าน</li>
          <li>เพื่อตรวจสอบข้อมูลบนเว็บไซต์ www.ihavecpu.com</li>
          <li>เพื่อพัฒนาการใช้งานและเนื้อหาบนเว็บไซต์ www.ihavecpu.com</li>
          <li>เพื่อเข้าใจมุมมองการใช้งานของท่านบนเว็บไซต์ www.ihavecpu.com</li>
          <li>เพื่อศึกษาพฤติกรรมของผู้ใช้งานเว็บไซต์ www.ihavecpu.com</li>
          <li>เพื่อให้ข้อมูลที่เป็นประโยชน์ต่อท่านเมื่อท่านใช้บริการบนเว็บไซต์ www.ihavecpu.com</li>
          <li>เพื่อให้ข้อมูลเกี่ยวกับสินค้าและบริการของ เว็บไซต์ www.ihavecpu.com หรือผู้ขายรายอื่นๆบนเว็บไซต์ www.ihavecpu.com</li>
         </ul>
         <p>ท่านสามารถยกเลิกบริการประชาสัมพันธ์เกี่ยวกับกิจกรรมทางการตลาดและโปรโมชั่นต่างๆ ได้ทุกเมื่อ</p>
         <p>บริษัทอาจจำเป็นต้องเปิดเผยข้อมูลของท่าน หากบริษัทมีเหตุผลให้เชื่อว่าหากไม่เปิดเผยข้อมูลของท่าน ท่านอาจมีภัยคุกคามต่อชีวิตและสุขภาพได้ หรือ หากบริษัทต้องปฎิบัติตามการบังคับใช้ทางกฎหมายต่างๆ หรือเพื่อให้เป็นไปตามข้อกำหนดทางกฎเกณฑ์และกฏหมายและการร้องขอของหน่วยงานราชการใดๆ</p>
         <p>บริษัทอาจแบ่งปันข้อมูลของท่านให้กับบุคคลภายนอก หรือ บริษัทที่เกี่ยวข้องเพื่อวัตถุประสงค์ข้างต้น โดยเฉพาะอย่างยิ่งเพื่อให้ธุรกรรมของท่านสำเร็จลุล่วง และเพื่อบริหารจัดการบัญชี เพื่อทำการตลาดและเพื่อให้เป็นไปตามข้อกำหนดทางกฎเกณฑ์และกฎหมายและคำร้องขอตามที่ทางบริษัทเห็นว่าจำเป็น</p>
         <p>ในการแบ่งปันข้อมูลส่วนบุคคลของท่าน บริษัทจะพยายามอย่างยิ่งที่จะทำให้แน่ใจว่าบุคคลภายนอกและผู้ที่เกี่ยวข้องนั้นจะเก็บข้อมูลส่วนบุคคลของท่านไว้อย่างปลอดภัยโดยปราศจากการเข้าถึง การจัดเก็บ การใช้ การเปิดเผย หรือการกระทำที่เป็นความเสี่ยงอย่างใด ๆ โดยไม่ได้รับอนุญาต และจะเก็บข้อมูลส่วนบุคคลของท่านไว้เพียงเท่าที่ข้อมูลส่วนบุคคลของท่านยังคงมีความจำเป็นต่อการบรรลุวัตถุประสงค์ข้างต้น</p>
         <p> ในการดำเนินการพัฒนาธุรกิจ บริษัทอาจต้องทำการขายหรือซื้อห้างร้าน หรือหน่วยธุรกิจต่างๆ  ซึ่งในการทำธุรกรรมเหล่านี้ ข้อมูลของลูกค้าจึงถือเป็นสินทรัพย์ทางธุรกิจอย่างหนึ่งที่สามารถถ่ายโอนได้ แต่ยังคงอยู่ภายใต้ข้อสัญญาที่ให้ไว้ในนโยบายด้านความเป็นส่วนตัวที่มีมาแต่ก่อน เว้นแต่ในกรณีที่ท่านได้ให้ความยินยอมเป็นอย่างอื่น นอกจากนี้ หากมีกรณีที่บริษัทหรือสินทรัพย์ทั้งหมดของบริษัท ถูกเข้าถือครอง ข้อมูลของท่านก็ย่อมเป็นหนึ่งในสินทรัพย์ที่จะถูกถ่ายโอนไปด้วยเช่นกัน </p>

         <H4>ความปลอดภัยของข้อมูลส่วนบุคคล</H4>
         <p>บริษัทจัดเก็บข้อมูลทั้งหมดของท่านไว้อย่างปลอดภัย และจะคุ้มครองข้อมูลส่วนบุคคลของท่านโดย </p>
         <ul>
          <li>จำกัดการเข้าถึงข้อมูลส่วนบุคคล</li>
          <li>บำรุงรักษาเครื่องมือเครื่องใช้ทางเทคโนโลยี เพื่อป้องกันการเข้าถึงคอมพิวเตอร์โดยไม่ได้รับอนุญาต</li>
          <li>ทำลายข้อมูลของท่านอย่างปลอดภัย เมื่อข้อมูลนั้นไม่มีความจำเป็นอีกต่อไปในทางกฎหมายหรือทางธุรกิจ </li>
         </ul>
         <p>รหัสผ่านของท่านจะเป็นเครื่องมือในการเข้าสู่บัญชีของท่าน  กรุณาใช้ตัวเลข ตัวอักษร และสัญลักษณ์พิเศษอันมีลักษณะบ่งเฉพาะ และไม่แบ่งปันรหัสผ่านของท่านให้กับผู้ใด  หากท่านแบ่งปันรหัสผ่านให้กับผู้อื่น ท่านจะต้องรับผิดชอบต่อการกระทำใดๆ รวมทั้งบรรดาผลที่เกิดขึ้นภายใต้ชื่อบัญชีของท่าน  หากท่านปล่อยให้รหัสผ่านของท่านเป็นที่ล่วงรู้ ท่านอาจไม่สามารถควบคุมข้อมูลส่วนบุคคล และข้อมูลอื่นๆ ของท่านที่ให้ไว้กับบริษัท นอกจากนี้ท่านอาจจะต้องผูกพันภายใต้บทบัญญัติของกฎหมายในนามของท่าน  ดังนั้น หากรหัสผ่านของท่านมีความเสี่ยงที่จะเป็นที่ล่วงรู้ ท่านควรติดต่อบริษัททันทีและทำการเปลี่ยนรหัสผ่านของท่าน  บริษัทขอเตือนว่าท่านจะต้องทำการออกจากระบบบัญชีของท่านและปิดโปรแกรมท่องอินเตอร์เน็ตทุกครั้งเมื่อท่านเสร็จสิ้นการใช้คอมพิวเตอร์สาธารณะ </p>
      
         <H4>การใช้งานคุกกี้</H4>
         <p>คุกกี้ คือ ไฟล์ขนาดเล็กซึ่งใช้ในการจัดเก็บข้อมูลโดยการบันทึกลงไปในอุปกรณ์คอมพิวเตอร์ และ/หรือเครื่องมืออุปกรณ์อื่น ๆ ที่ท่านได้ใช้งาน เช่น สมาร์ทโฟน หรือแท็บเล็ต เป็นต้น บริษัทใช้งานคุกกี้ และ/หรือเทคโนโลยีในการติดตามอื่น ๆ นอกจากนี้ บริษัทยังใช้งานคุกกี้เพื่อติดตามจำนวนผู้ใช้งานเว็บไซต์บริษัท และการใช้งานเว็บไซต์บริษัทโดยผู้ใช้งานดังกล่าว</p>
         <p>ประเภทของคุกกี้ที่บริษัทใช้และรายละเอียดการใช้คุกกี้ดังกล่าว ประกอบด้วยรายการดังต่อไปนี้</p>
          <ul>
            <li><b>คุกกี้ประเภทจำเป็น</b>บริษัทจะใช้คุกกี้ประเภทนี้เพื่อให้ท่านสามารถเข้าถึงข้อมูลและใช้งานในเว็บไซต์ของบริษัทได้อย่างมีประสิทธิภาพ รวมถึง เพื่อช่วยในการแลกเปลี่ยนข้อมูล และสื่อสารระหว่างเว็บเบราว์เซอร์กับเซิร์ฟเวอร์ของท่าน</li>
            <li><b>คุกกี้ประเภทการวิเคราะห์ </b>และวัดผลการทำงาน บริษัทฯจะใช้คุกกี้ประเภทนี้เพื่อวัดผลการทำงาน โดยประมวลการเข้าเยี่ยมชม ตลอดจนจำนวนลักษณะเฉพาะของกลุ่มผู้ใช้งานนั้น ๆ โดยข้อมูลดังกล่าวจะนำมาใช้ในการวิเคราะห์รูปแบบพฤติกรรมของผู้ใช้งาน ทำให้บริษัททราบถึงพฤติกรรมในการเยี่ยมชมเว็บไซต์ เพื่อนำมาปรับปรุงการทำงานของเว็บไซต์ให้มีคุณภาพดีขึ้นและมีความเหมาะสมมากขึ้น</li>
            <li><b>คุกกี้ประเภทการทำงาน </b>บริษัทใช้คุกกี้ประเภทนี้เพื่อจดจำคุณลักษณะต่าง ๆ ที่ท่านได้เลือกหรือตั้งค่าในขณะใช้งานในเว็บไซต์ของบริษัท ข้อมูลที่ถูกบันทึกไว้เหล่านี้จะถูกนำกลับมาใช้อีกครั้งในคราวที่ท่านกลับมาเยี่ยมชมเว็บไซต์ของบริษัท สิ่งที่ท่านเคยได้เลือกใช้หรือ ตั้งค่านั้นจะนำมาแสดงผลโดยที่ท่านไม่จำเป็นต้องทำการเลือกหรือตั้งค่าใหม่อีกครั้งเพื่อความสะดวกในการใช้งานของท่าน เช่น ภาษา ข้อมูลรายละเอียดสำหรับการล็อกอินแสดงไว้อยู่แล้ว หรือข้อมูลที่กรอกไว้อยู่แล้วในแบบฟอร์มบริการ</li>
            <li><b>คุกกี้เพื่อการตลาด</b>(การขาย/ให้บริการตามความสนใจ) บริษัทอาจใช้คุกกี้และข้อมูลที่ได้จากการใช้คุกกี้มาเพื่อวิเคราะห์ความสนใจ เพื่อประโยชน์ในการเสนอสอนค้า บริการ และโปรโมชั่นที่เหมาะสมให้แก่ท่าน</li>
            <li><b>คุกกี้อื่น ๆ </b>บริษัทใช้คุกกี้อื่น ๆ ของบุคคลภายนอกซึ่งทำงานร่วมกับบริษัทด้วย ซึ่งคุกกี้เหล่านี้ทำให้บุคคลภายนอกสามารถวิเคราะห์ข้อมูลเช่น จำนวนครั้งของการเข้าชม พฤติกรรมบนเว็บไซต์ของผู้ใช้งานประเภทของเบราว์เซอร์และอุปกรณ์อิเล็กทรอนิกส์ ข้อมูลจากไฟล์พิกเซล หรือข้อมูลอื่น ๆ เกี่ยวกับพฤติกรรมของท่าน (เช่นตำแหน่งที่ตั้ง) วัตถุประสงค์ของการเก็บและประมวลผลคุกกี้คือการรวบรวมข้อมูลเกี่ยวกับรายละเอียดของผู้เข้าชมเว็บไซต์ของบริษัท พฤติกรรม ลักษณะการใช้งานที่ชอบ และความสนใจในบริการต่าง ๆ ของผู้เข้าชมเว็บไซต์ คุกกี้ประเภทนี้จะทำให้สามารถแสดงโฆษณาและข้อเสนอทางการตลาด และทำให้สามารถวิเคราะห์ข้อมูลเกี่ยวกับความสนใจของท่านต่อสื่อวัสดุที่ปรากฎอยู่</li>
          </ul>

          <H4>การเปลี่ยนนโยบายฯ</H4>
          <p>บริษัทอาจทำการเปลี่ยนแปลงนโยบายฯ ฉบับนี้เป็นครั้งคราวเมื่อจำเป็น หรือเมื่อกฎหมายที่ใช้บังคับได้กำหนด โดยบริษัทจะแจ้งให้ท่านทราบถึงการเปลี่ยนแปลงใด ๆ ดังกล่าวผ่านทางเว็บไซต์ของบริษัท ทั้งนี้ ในกรณีที่การเปลี่ยนแปลงใด ๆ นั้นกฎหมายที่ใช้บังคับกำหนดให้ได้รับความยินยอม เราจะทำการขอความยินยอมจากท่านก่อนการเปลี่ยนแปลงดังกล่าวจะมีผลใช้บังคับ ทั้งนี้ โปรดอ้างอิงถึงวันที่บนหัวกระดาษของนโยบายฯ ฉบับนี้ เพื่อให้ทราบถึงวันที่ที่ได้มีการเปลี่ยนแปลงนโยบายฯ ครั้งล่าสุด</p>

          <H4>การยกเลิกความยินยอม</H4>
            <p>ท่านอาจแสดงเจตนาที่จะยกเลิกไม่ให้บริษัทใช้หรือเปิดเผยข้อมูลส่วนบุคคลของท่านอีกต่อไปไม่ว่าเพื่อวัตถุประสงค์ใดๆ และไม่ว่าในกรณีใดๆ ตามที่ระบุไว้ข้างต้น ได้ทุกเมื่อ กรุณาติดต่อบริษัททาง  ที่เบอร์ 02-105-4757 กด 1 หรือ info@ihavecpu.com  เพื่อแสดงเจตนาของท่านในการยกเลิกความยินยอม อย่างไรก็ตามหากท่านไม่อนุญาตให้บริษัทใช้หรือเปิดเผยข้อมูลของท่าน บริษัทอาจจะไม่สามารถจัดหาสินค้าหรือบริการให้กับท่าน หรือไม่สามารถปฏิบัติตามสัญญาที่ได้ให้ไว้กับท่านอีกต่อไป ทั้งนี้ขึ้นอยู่กับลักษณะของการยกเลิกของท่าน ทางบริษัทขอสงวนสิทธิโดยชัดแจ้งในการใช้สิทธิและการเยียวยาทางกฎหมายของบริษัทในกรณีดังกล่าว </p>
      </Card1>
    </Fragment>
  );
};

Privacy.layout = TermsandConditionsLayout;

export default Privacy;
