import { Fragment } from "react";
import { H3, H4, H6 } from "@component/Typography";
import { Card1 } from "@component/Card1";
import DashboardPageHeader from "@component/layout/DashboardPageHeader";
import CustomerDashboardLayout from "@component/layout/customer-dashboard";

// ====================================================
// ====================================================

const Returns = () => {
  return (
    <Fragment>
      <DashboardPageHeader title="การคืนสินค้าและการคืนเงิน" iconName="bag_filled" />

<Card1>
       <H3>การคืนสินค้า</H3> 
       <H6>ทางบริษัทฯ มีนโยบายการคืนสินค้า ในกรณีที่ระบุไว้ ตามเงื่อนไขด้านล่างเท่านั้น โดยบริษัทฯ ขอสงวนสิทธิ์ในการเปลี่ยนแปลงเงื่อนไข โดยไม่ต้องแจ้งให้ทราบล่วงหน้า </H6>
       <H3>เงื่อนไขในการขอคืนสินค้า </H3> 
       <H4>1. สินค้าส่งผิดสี ผิดรุ่น หรือ ผิดขนาด</H4>
        <ul>
            <li>ลูกค้าโทรศัพท์แจ้งความประสงค์ ขอคืน ที่แผนกบริการลูกค้า  ไอ แฮฟ ซีพียู  ออนไลน์ที่เบอร์ 02-105-4757 หรือ info@ihavecpu.com ได้ทุกวัน ไม่มีวันหยุด ตั้งแต่เวลา 9.00 – 19.00 น. เพื่อขอสิทธิ์เข้าระบบการทำรายการคืนสินค้า (Return Merchandise Authorization: RMA)</li>
            <li>เจ้าหน้าที่จะตรวจสอบคำสั่งซื้อ พร้อมข้อมูลการจัดส่งสินค้า เพื่อพิจารณาการให้สิทธิ์เข้าใช้งานระบบการคืนสินค้า (Return Merchandise Authorization: RMA)</li>
            <li>ลูกค้าทำการล็อกอิน เข้าสู่บัญชี และทำการใส่ข้อมูลรายละเอียดการคืนสินค้า และอัพโหลดรูปภาพสินค้าที่ต้องการคืน ที่เมนู RMA หลังจากเจ้าหน้าที่อนุมัติการส่งคืนสินค้า </li>
            <li>เจ้าหน้าที่จะดำเนินการประสานงานบริษัทขนส่งเอกชน ทำการติดต่อลูกค้าเพื่อไปรับสินค้าดังกล่าวคืนบริษัทฯ โดยจะมีการโทรติดต่อลูกค้าล่วงหน้า 1 วัน และ ติดต่อก่อนเข้ารับสินค้าภายในวันที่กำหนด</li>
            <li>ลูกค้าทำการจัดเตรียมสินค้าส่งคืน โดยสินค้ามีสภาพสมบูรณ์ กล่องโฟมกันกระแทก ซองใส่สินค้า คู่มือ ฯลฯ อุปกรณ์ครบถ้วน เหมือนเช่นเดียวกับตอนที่ได้รับสินค้าจากบริษัทฯ พร้อมเอกสารประกอบ เพื่อส่งมอบกลับมาให้กับเจ้าหน้าที่บริษัทขนส่ง</li>
            <li>บริษัทฯ จะโอนเงินค่าสินค้าและค่าขนส่ง (ถ้ามี) คืนให้กับลูกค้า ตามรูปแบบการชำระค่าสินค้า ภายใน 15 – 30 วัน</li>
        </ul>
        <H4>2. สินค้าเสีย หลังจากได้รับสินค้า ภายใน 7 วัน</H4>
        <ul>
            <li>ลูกค้าตรวจสอบนโยบายการ คืนสินค้า และ การรับประกันตามเงื่อนไขของประเภทสินค้า ภายใน 7 วัน นับตั้งแต่ได้รับสินค้าแผนกบริการลูกค้า ไอ แฮฟ ซีพียู ออนไลน์ที่เบอร์ 02-105-4757 หรือ info@ihavecpu.com ได้ทุกวัน ไม่มีวันหยุด เพื่อขอสิทธิ์เข้าระบบการทำรายการคืนสินค้า (RMA) </li>
            <li>เจ้าหน้าที่จะตรวจสอบคำสั่งซื้อ พร้อมข้อมูลการจัดส่งสินค้า เพื่อพิจารณาการให้สิทธิ์เข้าใช้งานระบบการคืนสินค้า (RMA)</li>
            <li>ลูกค้าทำการล็อกอิน เข้าสู่บัญชี และทำการใส่ข้อมูลรายละเอียดการคืนสินค้า และอัพโหลดรูปภาพสินค้าที่ต้องการคืน ที่เมนู RMA หลังจากเจ้าหน้าที่อนุมัติการส่งคืนสินค้า </li>
            <li>ลูกค้าสามารถนำสินค้าพร้อมเอกสารประกอบ ฝากคืนที่ร้าน ไอ แฮฟ ซีพียู  ได้ทุกสาขา หรือทำการจัดส่งสินค้ากลับคืนบริษัทฯ ทางไปรษณีย์ ( EMS ) หรือนำส่งผ่าน บริษัทขนส่งเอกชน โดยสินค้าต้องอยู่ในสภาพที่สมบูรณ์ อุปกรณ์และกล่องใส่สินค้าครบ กล่องโฟมกันกระแทก ซองใส่สินค้า คู่มือ ฯลฯ อุปกรณ์ครบถ้วน เหมือนเช่นเดียวกับตอนที่ได้รับสินค้าจากบริษัทฯ</li>
            <li>เจ้าหน้าที่บริการลูกค้าได้รับสินค้าจากร้าน ไอ แฮฟ ซีพียู ไปรษณีย์ (EMS) หรือ บริษัทขนส่งเอกชน พร้อมทำการตรวจสอบสินค้าตามเงื่อนไข</li>
            <li>บริษัทฯ จะทำการโอนเงินค่าสินค้าและค่าขนส่ง (ถ้ามี) ตามรูปแบบการชำระค่าสินค้า ภายใน 15 – 30 วัน</li>
        </ul>
        <H6>* ในกรณีที่สินค้า ไม่อยู่ในเงื่อนไขการรับคืนสินค้า หรือตรวจและทดสอบแล้วสินค้าไม่เจออาการเสียตามที่ได้ระบุ เจ้าหน้าที่จะดำเนินการส่งสินค้าดังกล่าว กลับคืนแก่ลูกค้า ทางไปรษณีย์ลงทะเบียน ( EMS ) ตามที่อยู่การจัดส่งสินค้า โดยจะทำการเก็บค่าขนส่งปลายทาง</H6>
            <p></p>
        <H4>3. กล่องบรรจุภัณฑ์ขนส่งสินค้า บุบ ฉีก ขาด ไม่สมบูรณ์ กล่องมีการถูกเปิดก่อนรับสินค้า</H4>
        <ul>
            <li>ลูกค้าสามารถแจ้งปฏิเสธการรับสินค้าจากบริษัทขนส่งเอกชน พร้อมถ่ายภาพ เก็บบันทึกข้อมูลเพื่อเป็นหลักฐาน</li>
            <li>ลูกค้าโทรแจ้งแผนกบริการลูกค้า ไอ แฮฟ ซีพียู ออนไลน์ที่เบอร์ 02-105-4757 หรือ info@ihavecpu.com ในวันที่ได้รับสินค้าทันที เพื่อขอปฏิเสธการรับสินค้า</li>
            <li>ในกรณีที่ลูกค้าชำระเงินแล้ว เจ้าหน้าที่จะดำเนินการคืนเงินค่าสินค้าพร้อมค่าขนส่ง (ถ้ามี) ภายใน 15 – 30 วัน โดยลูกค้าจัดส่งเอกสารประกอบ ผ่านทางไปรษณีย์ หรือ ทางอีเมลเจ้าหน้าที่แผนกบริการลูกค้า ไอ แฮฟ ซีพียู ออนไลน์ที่เบอร์ 02-105-4757 หรือ info@ihavecpu.com  พร้อมเตรียมเอกสารประกอบการรับเงินคืนดังนี้ สำเนาหน้าบัญชีธนาคาร (BookBank) พร้อมเซ็นรับรองสำเนาถูกต้อง เพื่อให้บริษัท โอนเงินค่าสินค้าและค่าขนส่งคืน (กรณีชำระเป็นเงินสด)</li>
            <li>สำเนาบัตรประชาชน พร้อมเซ็นรับรองสำเนาถูกต้อง</li>
        </ul>
        <H4>ใบเสร็จรับเงิน (ฉบับจริง)</H4>
        <ul>
            <li>สำเนาหน้าบัญชีธนาคาร (Book Bank) พร้อมเซ็นรับรองสำเนาถูกต้อง เพื่อให้บริษัท โอนเงินค่าสินค้าและค่าขนส่งคืน (กรณีชำระเป็นเงินสด)</li>
            <li>สำเนาบัตรประชาชน พร้อมเซ็นรับรองสำเนาถูกต้อง</li>
            <li>ที่อยู่ในการจัดส่งสินค้าคืน</li>
        </ul>

        <H4>ที่อยู่ในการจัดส่งสินค้าคืน</H4>
        <ul>
            <li>ฝ่ายเซอร์วิส ช้อปออนไลน์ บริษัท ไอ แฮฟ ซีพียู จำกัด</li>
            <li>ไอ แฮฟ ซีพียู (สำนักงานใหญ่) ที่อยู่ 228 ตำบล หนองแสง อำเภอปากพลี นครนายก 26130 </li>
        </ul>
        <H6>*ในกรณีที่ลูกค้ามีการคืนสินค้า ผ่านช่องทางขนส่งทางไปรษณีย์ด่วนพิเศษ (EMS) หรือ บริษัทขนส่งเอกชน บริษัทฯ จะยึดวันที่มีการประทับตราไปรษณีย์เป็นหลักฐานในการตรวจสอบระยะเวลาของการรับประกันสินค้า</H6>
        <p>เพื่อให้เกิดความพึงพอใจสูงสุดในการเลือกซื้อสินค้า กับ เว็บไซต์ ihavecpu.com ซึ่งเป็นร้านค้าออนไลน์ ของบริษัท ไอ แฮฟ ซีพียู จำกัด เราพร้อมมอบนโยบายการให้การบริการคืนสินค้าดังนี้</p>
        <p></p>
        <H4>ประเภทสินค้าที่ไม่สามารถรับคืน</H4>
        <ul>
            <li>สินค้ามีสภาพไม่สมบูรณ์ มีการแกะ ฉีกขาด หรือแตกต่างจากสภาพเดิมก่อนส่งสินค้า ที่มีสภาพไม่พร้อมต่อการขาย จะไม่สามารถรับเปลี่ยนหรือคืนสินค้าได้</li>
            <li>สินค้าประเภท สินค้าล้างสต๊อก สินค้าสำหรับแถม หรือของแถมตามโปรโมชั่น </li>
        </ul>
        <H6>* การรับประกันสินค้า จะเริ่มนับระยะเวลาการรับประกันสินค้า ตั้งแต่วันที่ลูกค้าทำการเซ็นต์เอกสารรับสินค้าจาก บริษัทขนส่งเอกชน</H6>
        <H6>** ลูกค้ากรุณาตรวจสอบระยะเวลาการรับประกันสินค้า เงื่อนไขการรับประกันสินค้าอย่างละเอียด เพื่อประกอบการพิจารณาระหว่างการเลือกซื้อสินค้าจากเว็บไซต์ iHAVECPU.com ซึ่งจะมีการแสดงข้อมูลการรับประกัน พร้อมเงื่อนไข ให้ลูกค้าทราบในรายละเอียดของสินค้าแต่ละชนิดหรือแต่ละรุ่น เพื่อให้ลูกค้าได้ใช้งานสินค้าตรงตามความต้องการ และตรงกับประเภทของการใช้งานสินค้านั้นๆ</H6>

        <H4>เอกสารที่ต้องใช้ในประกอบในการส่งคืนสินค้า</H4>
        <ul>
            <li>ใบเสร็จรับเงินฉบับจริง</li>
            <li>สำเนาหน้าบัญชีธนาคาร (BookBank) พร้อมเซ็นรับรองสำเนาถูกต้อง เพื่อให้บริษัท โอนเงินค่าสินค้าและค่าขนส่งคืน (กรณีชำระเงินสด)</li>
            <li>สำเนาบัตรประชาชน พร้อมเซ็นรับรองสำเนาถูกต้อง</li>
        </ul>

        <H3>การคืนเงิน</H3> 

        <H4>รูปแบบและวิธีการคืนเงิน</H4>
        <ul>
            <li>กรณีชำระสินค้าผ่านบัตรเครดิต แบบชำระเงินเต็มจำนวนหรือแบบผ่อนชำระ บริษัทฯจะทำการคืนเงินค่าสินค้า กลับเข้าวงเงินบัญชีบัตรเครดิตที่ลูกค้าใช้ทำการซื้อสินค้า ภายในระยะเวลา 15 – 30 วัน (ขอสงวนสิทธิ์ข้อมูลชื่อบนบัตรเครดิตต้องตรงตามรายชื่อผู้สั่งซื้อสินค้าบนเว็บไซต์เท่านั้น)</li>
            <li>กรณีชำระสินค้าผ่านเคาท์เตอร์ธนาคาร, เคาท์เตอร์เซอร์วิส, หักบัญชีธนาคาร, เก็บเงินสดปลายทาง หรือ เอทีเอ็ม บริษัทฯจะทำการคืนเงินค่าสินค้า คืนกลับเข้าบัญชีธนาคาร ที่ลูกค้าได้ทำการแจ้งไว้ทีเมนูขอคืนสินค้า ภายในระยะเวลา 15 -30 วัน นับตั้งแต่วันที่บริษัทฯ ได้รับเอกสารครบ*</li>
        </ul>
        <H3>เอกสารแนบในการคืนเงิน กรณี เงินสด</H3> 

        <H4>ลูกค้าทั่วไป/บุคคลธรรมดา</H4>
        <ul>
            <li>สำเนาบัตรประชาชน เซ็นชื่อรับรองสำเนาถูกต้อง พร้อมระบุ "ใช้เพื่อขอรับเงินคืนจาก iHAVECPU เท่านั้น"</li>
            <li>สำเนาหน้าบัญชีธนาคาร (Book bank)</li>
            <li>สลิปการโอนเงิน/หลักฐานการชำระเงิน</li>
        </ul>

        <H4>ลูกค้านิติบุคคล</H4>
        <ul>
            <li>สำเนาหนังสือรับรองบริษัทฯ และภพ.20</li>
            <li>สำเนาหน้าบัญชีธนาคารของบริษัทฯ</li>
            <li>สำเนาหลักฐาน/สลิปการชำระเงิน</li>
        </ul>
        <H6>สอบถามเพิ่มเติม เแผนกบริการลูกค้า ไอ แฮฟ ซีพียู ออนไลน์ที่เบอร์ 02-105-4757 หรือ info@ihavecpu.com  ได้ในเวลาทำการ ตั้งแต่เวลา 10.00 น. -17.00 น. (เว้นวันเสาร์) </H6>
 
      </Card1>
    </Fragment>
  );
};

Returns.layout = CustomerDashboardLayout;

export default Returns;
