import { Fragment } from "react";
import { H3, H4, H6 } from "@component/Typography";
import { Card1 } from "@component/Card1";
import DashboardPageHeader from "@component/layout/DashboardPageHeader";
import CustomerDashboardLayout from "@component/layout/customer-dashboard";

// ====================================================
// ====================================================

const Shippings = () => {
  return (
    <Fragment>
      <DashboardPageHeader title="การจัดส่งสินค้า" iconName="bag_filled" />

<Card1>
       <H3>การจัดส่งสินค้า</H3> 
         <H4>จัดส่งสินค้าแบบธรรมดา (Next Day Delivery 1-3 วันทำการ*)</H4>
         <H6>ihavecpu.com มีการให้บริการจัดส่งสินค้าแบบธรรมดา ภายในระยะเวลา 1-3 วันทำการ ขึ้นอยู่กับพื้นที่ให้บริการ** โดยมีค่าบริการขนส่งเพิ่มเติมในกรณีที่ยอดสั่งซื้อ ต่ำกว่า 3,000 บาท</H6>
         <H6>**ค่าบริการขนส่ง อาจมีการปรับเปลี่ยนตามความเหมาะสม หรือตามช่วงเวลาโปรโมชั่นที่กำหนด ลุกค้าสามารถเช็คค่าบริการขนส่งได้ในหน้า Review Order ก่อนขั้นตอนการชำระเงิน</H6>
         <p></p>
         <H4>เงื่อนไขในการให้บริการจัดส่งสินค้า Standard Delivery </H4>
        <ul>
            <li>หากลูกค้าทำรายการสั่งซื้อสินค้าและมีการชำระเงินเสร็จสมบูรณ์ภายในเวลา 17.00 น. ของวันดังกล่าว สินค้าจะถูกจัดเตรียมและดำเนินการจัดส่งสินค้าให้เร็วที่สุดแก่ลูกค้า ภายในระยะเวลา 1 – 3 วัน  (ไม่รวมวันหยุดเสาร์และอาทิตย์ และวันหยุกนักขัตฤกษ์)</li>
            <li>สินค้าประเภท คอมพิวเตอร์ประกอบ (DIY Computer) ► พื้นที่กรุงเทพฯ ใช้เวลาในการจัดส่ง 5-7 วันทำการ ► พื้นที่ต่างจังหวัด ใช้เวลาในการจัดส่ง 7-10 วันทำการ ติดต่อสอบถามเแผนกบริการลูกค้า ไอ แฮฟ ซีพียู ออนไลน์ที่เบอร์ 02-105-4757 หรือ info@ihavecpu.com ได้ในเวลาทำการ ตั้งแต่เวลา 10.00 น. -17.00 น. (เว้นวันเสาร์).</li>
            <li>การจัดส่งสินค้าแต่ละรายการคำสั่งซื้อสินค้า ลูกค้าอาจได้รับสินค้าแตกต่างเวลา และจำนวนกล่องสินค้าที่แยกตามรายการสินค้า ทั้งนี้บริษัทฯจะดำเนินการจัดส่งสินค้าให้ลูกค้าได้รับอย่างรวดเร็วและครบถ้วนที่สุด ตามมาตรฐานการให้บริการของบริษัทฯ</li>
            <li>การจัดส่งสินค้าให้กับลูกค้า บางครั้งอาจได้รับผลกระทบเกิดความล่าช้าจากเหตุสุดวิสัย ทั้ง จากภัยธรรมชาติ หรือ ผลกระทบทางการเมือง ซึ่งส่งผลให้เกิดความล่าช้าในการจัดส่งเกิน 5 วันทำการ บริษัทฯจะประสานงานกับบริษัทขนส่งเอกชน เพื่อแก้ไขปัญหา ให้ลูกค้าได้รับสินค้าอย่างเร็วที่สุด</li>
            <li>เมื่อลูกค้าได้รับการแจ้งการจัดส่งสินค้าจาก ไอ แฮฟ ซีพียู ออนไลน์ สินค้าจะถูกจัดส่งไปตามที่อยู่ปลายทางจัดส่ง ตามที่ลูกค้าได้ระบุไว้ในขั้นตอนการทำรายการสั่งซื้อสินค้าเท่านั้น ขอสงวนสิทธิ์ในการเปลี่ยนแปลงที่อยู่ในการจัดส่ง เมื่อสินค้ากำลังนำส่งโดยบริษัทฯขนส่งเอกชน</li>
            <li>ลูกค้าสามารถตรวจสอบสถานะการจัดส่งสินค้าได้ที่ Order History </li>
        </ul>
        <H6>ลูกค้าสามารถตรวจสอบสถานะการจัดส่งสินค้าผ่านระบบการให้บริการของบริษัทขนส่งเอกชน โดยใส่รหัส เลขขนส่ง ( Tracking Number ) ที่แสดงอยู่ในรายการข้อมูลสั่งซื้อสินค้าของลูกค้า ดังนี้</H6>
        <ul>
            <li>บริษัท ดีเอชแอล เอ๊กซ์เพรส อินเตอร์เนชั่นแนล (ประเทศไทย) ตรวจสอบสถานะสินค้าได้ที่ <a href="https://www.dhl.com/th-en/home/tracking.html" >www.dhl.com</a> </li>
            <li>บริษัท ฯ ขอสงวนสิทธิ์ในการยกเลิก เปลี่ยนแปลงเงื่อนไขการจัดส่งสินค้า โดยไม่ต้องแจ้งให้ทราบล่วงหน้า</li>
        </ul>

        <H4>การจัดส่งสินค้าแบบชำระเงินปลายทาง COD </H4>
        <H6>ระบบการจัดส่งสินค้าแบบชำระเงินปลายทาง COD จะใช้เวลาดำเนินการล่าช้าประมาณ 3-7 วันทำการ ขออภัยในความไม่สะดวก</H6>
        <ul>
            <li>พื้นที่กรุงเทพฯ ระยะเวลาจัดส่ง 1 - 3 วันทำการ ค่าบริการฟรี เมื่อยอดสั่งซื้อเกิน 3,000 บาท</li>
            <li>ต่างจังหวัด 2 - 4 วันทำการ เมื่อยอดสั่งซื้อเกิน 3,000 บาท</li>
            <li>** สำหรับบริการจัดส่งถึงบ้านพร้อมชำระเงินปลายทาง ( รับเฉพาะเงินสด ) ซึ่งจะมีการเก็บค่ามัดจำ 3% และอาจมีให้บริการเฉพาะสินค้าบางรายการ **</li>
        </ul>

        <H4>การรับสินค้าหน้าร้าน </H4>
        <ul>
            <li>หากชำระผ่านบัตรเครดิตและรับส่วนลด 1,000 บาท จะมีค่าธรรมเนียม 3%</li>
            <li>หากชำระผ่านบัตรเครดิต แต่ไม่รับส่วนลด 1,000 บาท จะไม่มีค่าธรรมเนียม 3%</li>
        </ul>


      </Card1>
    </Fragment>
  );
};

Shippings.layout = CustomerDashboardLayout;

export default Shippings;
