import { Fragment } from "react";
import { H3 } from "@component/Typography";
import { Card1 } from "@component/Card1";
import DashboardPageHeader from "@component/layout/DashboardPageHeader";
import TermsandConditionsLayout from "@component/layout/terms-and-conditions";

// ====================================================
// ====================================================

const Terms = () => {
  return (
    <Fragment>
      <DashboardPageHeader title="ข้อกำหนดและเงื่อนไข" iconName="credit" />

<Card1>
       <H3>ข้อกำหนดและเงื่อนไข</H3> 
         <p>เว็บไซต์นี้ประกอบด้วยเนื้อหาต่าง ๆ ทั้งที่เป็นตัวอักษร รูปภาพ, วีดีโอ, เสียง, รูปแบบ, ภาพถ่ายหรือข้อความผลิตภัณฑ์ของสินค้า และเนื้อหาสาระต่าง ๆ และเครื่องหมายทางการค้า ที่เป็นลิขสิทธิ์จดทะเบียนของ บริษัท ไอ แฮฟ ซีพียู จำกัด ซึ่งได้รับความคุ้มครองในด้านลิขสิทธิ์ และทรัพย์สินทางปัญญา โดยลิขสิทธิ์และทรัพย์สินทางปัญญา ทั้งหลายที่อยู่บนเว็บไซต์นี้เป็นกรรมสิทธิ์ของบริษัท ไอ แฮฟ ซีพียู จำกัด โดยได้รับอนุญาตจากผู้มีสิทธิเหล่านั้นเพื่อให้สามารถใช้เป็นส่วนหนึ่งของเว็บไซต์นี้ได้</p>
         <p>บริษัท ไอ แฮฟ ซีพียู จำกัด  มีสิทธิ์หรือมีอำนาจควบคุมการใช้เนื้อหานั้นห้ามมิให้ทำซ้ำ, ดัดแปลง, จัดเก็บ, ถ่ายโอน, ลอกเลียนแบบ, เผยแพร่ต่อสาธารณชน หรือกระทำการใดๆ อันเป็นการละเมิดลิขสิทธิ์หรือสิทธิในทรัพย์สินทางปัญญาโดยไม่ได้รับความยินยอมล่วงหน้าที่เป็นลายลักษณ์อักษรจาก บริษัท ไอ แฮฟ ซีพียู จำกัด เว้นแต่การใช้ จัดพิมพ์ หรือดาวน์โหลดเนื้อหาที่แสดงบนเว็บไซต์เพื่อใช้เป็นการส่วนบุคคล โดยผู้ใช้ต้องไม่ลบข้อความเกี่ยวกับลิขสิทธิ์หรือสิทธิในทรัพย์สินทางปัญญาออกจากเนื้อหานั้นๆ</p>
         <p>การบริการและคุณสมบัติบางอย่างที่เกี่ยวข้องกับการลงทะเบียนสมาชิกหรือลงทะเบียนเพื่อขอรับข้อมูลเพิ่มเติมอาจปรากฏอยู่บนเว็บไซต์ ซึ่งท่านจำเป็นต้องยินยอมที่จะให้ข้อมูลที่ถูกต้องและเป็นข้อมูลที่ถูกปรับปรุงล่าสุดอยู่เสมอ และทันทีที่อัพเดตข้อมูลดังกล่าวถ้ามีการเปลี่ยนแปลงใด ๆ ผู้ใช้เว็บไซต์ทุกคนเป็นผู้รับผิดชอบต่อการเก็บรหัสผ่านและระบุบัญชีอื่นที่มีความปลอดภัย เจ้าของบัญชีคือผู้ที่ต้องรับผิดชอบต่อการกระทำทั้งหมดที่เกิดขึ้นภายใต้ รหัสผ่านหรือบัญชีดังกล่าว</p>
         <p>ในกรณีที่ท่าน ไม่สามารถจำรหัสผ่านหรือบัญชีของท่านได้ ทางบริษัทจะไม่รับผิดชอบทั้งทางตรงหรือทางอ้อม ในการสูญเสียหรือความเสียหายที่เกิดขึ้น ที่เป็นผลจากการกระทำใดๆ หรือในความเกี่ยวข้องกับความล้มเหลวของท่านที่สอดคล้องกับส่วนนี้ กรณีที่ผู้ใช้บริการทราบว่ามีผู้อื่นใช้ชื่อบัญชีและรหัสผ่านของท่านไปใช้ โดยที่มิได้ให้ความยินยอม ไม่ว่าเพื่อวัตถุประสงค์ใดก็ตาม ผู้ใช้บริการต้องแจ้งให้ทางบริษัททราบทันที เพื่อบริษัทจะได้ยกเลิกการทำรายการสั่งซื้อสินค้า/บริการ หรือการทำธุรกรรมต่าง ๆ ที่เกิดขึ้นจากการกระทำดังกล่าว โดยสามารถแจ้งผ่านเว็บไซต์นี้ได้ทันที หรือแจ้งติดต่อ แผนกบริการลูกค้า ของ ไอ แฮฟ ซีพียู ที่เบอร์ 02-105-4757 กด 1 หรือ info@ihavecpu.com ได้ในวันและเวลาทำการ ตั้งแต่เวลา 10.00 น. -17.00 น. (เว้นวันเสาร์)</p>
      </Card1>
    </Fragment>
  );
};

Terms.layout = TermsandConditionsLayout;

export default Terms;
